YoshidoSan/SMS/poj2/backup_stm32f7xx_it.c
/**
  ******************************************************************************
  * @file    stm32f7xx_it.c
  * @brief   Interrupt Service Routines.
  ******************************************************************************
  *
  * COPYRIGHT(c) 2016 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "stm32f7xx_hal.h"
#include "stm32f7xx.h"
#include "stm32f7xx_it.h"
#include "stm32746g_discovery.h"
#include "stm32f7xx_hal_uart.h"
#include "modbus.h"

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/* External variables --------------------------------------------------------*/
extern TIM_HandleTypeDef htim2;
extern TIM_HandleTypeDef htim3;
extern TIM_HandleTypeDef htim4;
extern TIM_HandleTypeDef htim5;
extern LTDC_HandleTypeDef hltdc;
extern UART_HandleTypeDef huart;
extern UART_HandleTypeDef huartmb;

/******************************************************************************/
/*            Cortex-M7 Processor Interruption and Exception Handlers         */ 
/******************************************************************************/

/**
* @brief This function handles System tick timer.
*/
void SysTick_Handler(void)
{
  /* USER CODE BEGIN SysTick_IRQn 0 */

  /* USER CODE END SysTick_IRQn 0 */
  HAL_IncTick();
  HAL_SYSTICK_IRQHandler();
  /* USER CODE BEGIN SysTick_IRQn 1 */

  /* USER CODE END SysTick_IRQn 1 */
}

/******************************************************************************/
/* STM32F7xx Peripheral Interrupt Handlers                                    */
/* Add here the Interrupt Handlers for the used peripherals.                  */
/* For the available peripheral interrupt handler names,                      */
/* please refer to the startup file (startup_stm32f7xx.s).                    */
/******************************************************************************/

void LTDC_IRQHandler(void){
	HAL_LTDC_IRQHandler(&hltdc);
}

void EXTI15_10_IRQHandler(void){
	HAL_GPIO_EXTI_IRQHandler(TS_INT_PIN);
	HAL_GPIO_EXTI_IRQHandler(TAMPER_BUTTON_PIN);
	touch();
}

void TIM2_IRQHandler(void) 
{	
	HAL_TIM_IRQHandler(&htim2);
	
}

void TIM3_IRQHandler(void) 
{	
	HAL_TIM_IRQHandler(&htim3);
}

void TIM4_IRQHandler(void) 
{	
	HAL_TIM_IRQHandler(&htim4);
	
}

void TIM5_IRQHandler(void) 
{	
	HAL_TIM_IRQHandler(&htim5);
	
}

void USART1_IRQHandler(void)
{
  HAL_UART_IRQHandler(&huart);
}

void USART6_IRQHandler(void)
{
//	if(__HAL_UART_GET_IT(&huartmb, UART_IT_RXNE)){
		//SetCharacterReceived(true);
	//}
	//if(__HAL_UART_GET_IT(&huartmb, UART_IT_TXE)){	
//		SetCharacterReadyToTransmit();
//	}
  //if( USART_GetITStatus(USART1, USART_IT_RXNE) ){
//    USART_ClearITPendingBit(USART1, USART_IT_RXNE);
		//SetCharacterReceived(true);
  //} 
  //if( USART_GetITStatus(USART1, USART_IT_TXE) ){
//    USART_ClearITPendingBit(USART1, USART_IT_TXE);
		//SetCharacterReadyToTransmit();
  //}
	
  HAL_UART_IRQHandler(&huartmb);
}


/* USER CODE BEGIN 1 */

/* USER CODE END 1 */
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
